blog4/app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "好天气"], ["content", "今天好天气，我们来上ruby课"], ["created_at", "2024-10-26 15:26:03.853996"], ["updated_at", "2024-10-26 15:26:03.853996"]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "Updated title"], ["content", "Updated content"], ["updated_at", "2024-10-26 16:07:14.420567"], ["id", 980190962]]

  def destroy
    @blog.destroy!
---
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 980190962]]