blog4/app/controllers/comments_controller.rb

  def create
    @comment = @blog.comments.build(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("blog_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["blog_id", 1], ["content", "天气确实好"], ["created_at", "2024-10-26 15:53:51.295391"], ["updated_at", "2024-10-26 15:53:51.295391"]]

  def set_blog
    @blog = Blog.find(params[:blog_id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]

  def set_comment
    @comment = @blog.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ? AND "comments"."id" = ? LIMIT ?  [["blog_id", 980190962], ["id", 980190962], ["LIMIT", 1]]